apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_ocotp.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/imxrt_ocotp.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_OCOTP_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_OCOTP_H

/* The OCOTP IP block provides a set of register to access the On Chip OPT.
 * It also provides a shadow image of the 64 OTP entries that are read only
 * memory addressable (OCOTP Shadow Offsets). To read or write the actual
 * OTP, OCOTP Indexes are used.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/imxrt_memorymap.h"

#if defined(CONFIG_ARCH_FAMILY_IMXRT117x)
#  include "hardware/rt117x/imxrt117x_ocotp.h"
#elif defined(CONFIG_ARCH_FAMILY_IMXRT118x)
#  include "hardware/rt118x/imxrt118x_ocotp.h"
#else

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define IMXRT_OCOTP_CTRL_OFFSET               0x0000  /* OTP Controller Control Register */
#define IMXRT_OCOTP_CTRL_SET_OFFSET           0x0004  /* OTP Controller Control Register */
#define IMXRT_OCOTP_CTRL_CLR_OFFSET           0x0008  /* OTP Controller Control Register */
#define IMXRT_OCOTP_CTRL_TOG_OFFSET           0x000c  /* OTP Controller Control Register */
#define IMXRT_OCOTP_TIMING_OFFSET             0x0010  /* OTP Controller Timing Register */
#define IMXRT_OCOTP_DATA_OFFSET               0x0020  /* OTP Controller Write Data Register */
#define IMXRT_OCOTP_READ_CTRL_OFFSET          0x0030  /* OTP Controller Write Data Register */
#define IMXRT_OCOTP_READ_FUSE_DATA_OFFSET     0x0040  /* OTP Controller Read Data Register */
#define IMXRT_OCOTP_SW_STICKY_OFFSET          0x0050  /* Sticky bit Register */
#define IMXRT_OCOTP_SCS_OFFSET                0x0060  /* Software Controllable Signals Register */
#define IMXRT_OCOTP_SCS_SET_OFFSET            0x0064  /* Software Controllable Signals Register */
#define IMXRT_OCOTP_SCS_CLR_OFFSET            0x0068  /* Software Controllable Signals Register */
#define IMXRT_OCOTP_SCS_TOG_OFFSET            0x006c  /* Software Controllable Signals Register */
#define IMXRT_OCOTP_CRC_ADDR_OFFSET           0x0070  /* OTP Controller CRC test address */
#define IMXRT_OCOTP_CRC_VALUE_OFFSET          0x0080  /* OTP Controller CRC Value Register */
#define IMXRT_OCOTP_VERSION_OFFSET            0x0090  /* OTP Controller Version Register */
#define IMXRT_OCOTP_TIMING2_OFFSET            0x0100  /* OTP Controller Timing Register */

/* OCOTP Shadow Offsets *****************************************************/

#define IMXRT_OCOTP_LOCK_OFFSET               0x0400  /* Value of OTP Bank0 Word0 (Lock controls) */
#define IMXRT_OCOTP_CFG0_OFFSET               0x0410  /* Value of OTP Bank0 Word1 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG1_OFFSET               0x0420  /* Value of OTP Bank0 Word2 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG2_OFFSET               0x0430  /* Value of OTP Bank0 Word3 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG3_OFFSET               0x0440  /* Value of OTP Bank0 Word4 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG4_OFFSET               0x0450  /* Value of OTP Bank0 Word5 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG5_OFFSET               0x0460  /* Value of OTP Bank0 Word6 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG6_OFFSET               0x0470  /* Value of OTP Bank0 Word7 (Configuration and Manufacturing */
#define IMXRT_OCOTP_MEM0_OFFSET               0x0480  /* Value of OTP Bank1 Word0 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM1_OFFSET               0x0490  /* Value of OTP Bank1 Word1 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM2_OFFSET               0x04a0  /* Value of OTP Bank1 Word2 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM3_OFFSET               0x04b0  /* Value of OTP Bank1 Word3 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM4_OFFSET               0x04c0  /* Value of OTP Bank1 Word4 (Memory Related Info.) */
#define IMXRT_OCOTP_ANA0_OFFSET               0x04d0  /* Value of OTP Bank1 Word5 (Analog Info.) */
#define IMXRT_OCOTP_ANA1_OFFSET               0x04e0  /* Value of OTP Bank1 Word6 (Analog Info.) */
#define IMXRT_OCOTP_ANA2_OFFSET               0x04f0  /* Value of OTP Bank1 Word7 (Analog Info.) */
#define IMXRT_OCOTP_OTPMK0_OFFSET             0x0500  /* Value of OTP Bank2 Word0 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK1_OFFSET             0x0510  /* Value of OTP Bank2 Word1 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK2_OFFSET             0x0520  /* Value of OTP Bank2 Word2 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK3_OFFSET             0x0530  /* Value of OTP Bank2 Word3 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK4_OFFSET             0x0540  /* Value of OTP Bank2 Word4 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK5_OFFSET             0x0550  /* Value of OTP Bank2 Word5 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK6_OFFSET             0x0560  /* Value of OTP Bank2 Word6 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK7_OFFSET             0x0570  /* Value of OTP Bank2 Word7 (OTPMK Key) */
#define IMXRT_OCOTP_SRK0_OFFSET               0x0580  /* Shadow Register for OTP Bank3 Word0 (SRK Hash) */
#define IMXRT_OCOTP_SRK1_OFFSET               0x0590  /* Shadow Register for OTP Bank3 Word1 (SRK Hash) */
#define IMXRT_OCOTP_SRK2_OFFSET               0x05a0  /* Shadow Register for OTP Bank3 Word2 (SRK Hash) */
#define IMXRT_OCOTP_SRK3_OFFSET               0x05b0  /* Shadow Register for OTP Bank3 Word3 (SRK Hash) */
#define IMXRT_OCOTP_SRK4_OFFSET               0x05c0  /* Shadow Register for OTP Bank3 Word4 (SRK Hash) */
#define IMXRT_OCOTP_SRK5_OFFSET               0x05d0  /* Shadow Register for OTP Bank3 Word5 (SRK Hash) */
#define IMXRT_OCOTP_SRK6_OFFSET               0x05e0  /* Shadow Register for OTP Bank3 Word6 (SRK Hash) */
#define IMXRT_OCOTP_SRK7_OFFSET               0x05f0  /* Shadow Register for OTP Bank3 Word7 (SRK Hash) */
#define IMXRT_OCOTP_SJC_RESP0_OFFSET          0x0600  /* Value of OTP Bank4 Word0 (Secure JTAG Response Field) */
#define IMXRT_OCOTP_SJC_RESP1_OFFSET          0x0610  /* Value of OTP Bank4 Word1 (Secure JTAG Response Field) */
#define IMXRT_OCOTP_MAC0_OFFSET               0x0620  /* Value of OTP Bank4 Word2 (MAC Address) */
#define IMXRT_OCOTP_MAC1_OFFSET               0x0630  /* Value of OTP Bank4 Word3 (MAC Address) */
#define IMXRT_OCOTP_MAC2_OFFSET               0x0640  /* Value of OTP Bank4 Word4 (MAC Address) */
#define IMXRT_OCOTP_OTPMK_CRC32_OFFSET        0x0650  /* Value of OTP Bank4 Word5 (CRC Key) */
#define IMXRT_OCOTP_SW_GP1_OFFSET             0x0680  /* Value of OTP Bank5 Word0 (SW GP1) */
#define IMXRT_OCOTP_SW_GP20_OFFSET            0x0690  /* Value of OTP Bank5 Word1 (SW GP2) */
#define IMXRT_OCOTP_SW_GP21_OFFSET            0x06a0  /* Value of OTP Bank5 Word2 (SW GP2) */
#define IMXRT_OCOTP_SW_GP22_OFFSET            0x06b0  /* Value of OTP Bank5 Word3 (SW GP2) */
#define IMXRT_OCOTP_SW_GP23_OFFSET            0x06c0  /* Value of OTP Bank5 Word4 (SW GP2) */
#define IMXRT_OCOTP_MISC_CONF0_OFFSET         0x06d0  /* Value of OTP Bank5 Word5 (Misc Conf) */
#define IMXRT_OCOTP_MISC_CONF1_OFFSET         0x06e0  /* Value of OTP Bank5 Word6 (Misc Conf) */
#define IMXRT_OCOTP_SRK_REVOKE_OFFSET         0x06f0  /* Value of OTP Bank5 Word7 (SRK Revoke) */

#define IMXRT_OCOTP_ROM_PATCH0_OFFSET         0x0800  /* Value of OTP Bank6 Word0 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH1_OFFSET         0x0810  /* Value of OTP Bank6 Word1 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH2_OFFSET         0x0820  /* Value of OTP Bank6 Word2 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH3_OFFSET         0x0830  /* Value of OTP Bank6 Word3 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH4_OFFSET         0x0840  /* Value of OTP Bank6 Word4 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH5_OFFSET         0x0850  /* Value of OTP Bank6 Word5 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH6_OFFSET         0x0860  /* Value of OTP Bank6 Word6 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH7_OFFSET         0x0870  /* Value of OTP Bank6 Word7 (ROM Patch) */
#define IMXRT_OCOTP_GP30_OFFSET               0x0880  /* Value of OTP Bank7 Word0 (GP3) */
#define IMXRT_OCOTP_GP31_OFFSET               0x0890  /* Value of OTP Bank7 Word1 (GP3) */
#define IMXRT_OCOTP_GP32_OFFSET               0x08a0  /* Value of OTP Bank7 Word2 (GP3) */
#define IMXRT_OCOTP_GP33_OFFSET               0x08b0  /* Value of OTP Bank7 Word3 (GP3) */
#define IMXRT_OCOTP_GP40_OFFSET               0x08c0  /* Value of OTP Bank7 Word4 (GP4) */
#define IMXRT_OCOTP_GP41_OFFSET               0x08d0  /* Value of OTP Bank7 Word5 (GP4) */
#define IMXRT_OCOTP_GP42_OFFSET               0x08e0  /* Value of OTP Bank7 Word6 (GP4) */
#define IMXRT_OCOTP_GP43_OFFSET               0x08f0  /* Value of OTP Bank7 Word7 (GP4) */

/* OCOTP Indexes ************************************************************/

#define IMXRT_OCOTP_O2I(offset)               (((offset) - IMXRT_OCOTP_LOCK_OFFSET) >> 4)

#define IMXRT_OCOTP_LOCK_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_LOCK_OFFSET)         /* Value of OTP Bank0 Word0 (Lock controls) */
#define IMXRT_OCOTP_CFG0_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_CFG0_OFFSET)         /* Value of OTP Bank0 Word1 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG1_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_CFG1_OFFSET)         /* Value of OTP Bank0 Word2 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG2_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_CFG2_OFFSET)         /* Value of OTP Bank0 Word3 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG3_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_CFG3_OFFSET)         /* Value of OTP Bank0 Word4 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG4_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_CFG4_OFFSET)         /* Value of OTP Bank0 Word5 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG5_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_CFG5_OFFSET)         /* Value of OTP Bank0 Word6 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG6_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_CFG6_OFFSET)         /* Value of OTP Bank0 Word7 (Configuration and Manufacturing */
#define IMXRT_OCOTP_MEM0_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_MEM0_OFFSET)         /* Value of OTP Bank1 Word0 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM1_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_MEM1_OFFSET)         /* Value of OTP Bank1 Word1 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM2_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_MEM2_OFFSET)         /* Value of OTP Bank1 Word2 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM3_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_MEM3_OFFSET)         /* Value of OTP Bank1 Word3 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM4_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_MEM4_OFFSET)         /* Value of OTP Bank1 Word4 (Memory Related Info.) */
#define IMXRT_OCOTP_ANA0_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_ANA0_OFFSET)         /* Value of OTP Bank1 Word5 (Analog Info.) */
#define IMXRT_OCOTP_ANA1_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_ANA1_OFFSET)         /* Value of OTP Bank1 Word6 (Analog Info.) */
#define IMXRT_OCOTP_ANA2_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_ANA2_OFFSET)         /* Value of OTP Bank1 Word7 (Analog Info.) */
#define IMXRT_OCOTP_OTPMK0_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK0_OFFSET)       /* Value of OTP Bank2 Word0 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK1_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK1_OFFSET)       /* Value of OTP Bank2 Word1 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK2_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK2_OFFSET)       /* Value of OTP Bank2 Word2 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK3_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK3_OFFSET)       /* Value of OTP Bank2 Word3 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK4_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK4_OFFSET)       /* Value of OTP Bank2 Word4 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK5_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK5_OFFSET)       /* Value of OTP Bank2 Word5 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK6_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK6_OFFSET)       /* Value of OTP Bank2 Word6 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK7_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK7_OFFSET)       /* Value of OTP Bank2 Word7 (OTPMK Key) */
#define IMXRT_OCOTP_SRK0_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK0_OFFSET)         /* Shadow Register for OTP Bank3 Word0 (SRK Hash) */
#define IMXRT_OCOTP_SRK1_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK1_OFFSET)         /* Shadow Register for OTP Bank3 Word1 (SRK Hash) */
#define IMXRT_OCOTP_SRK2_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK2_OFFSET)         /* Shadow Register for OTP Bank3 Word2 (SRK Hash) */
#define IMXRT_OCOTP_SRK3_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK3_OFFSET)         /* Shadow Register for OTP Bank3 Word3 (SRK Hash) */
#define IMXRT_OCOTP_SRK4_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK4_OFFSET)         /* Shadow Register for OTP Bank3 Word4 (SRK Hash) */
#define IMXRT_OCOTP_SRK5_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK5_OFFSET)         /* Shadow Register for OTP Bank3 Word5 (SRK Hash) */
#define IMXRT_OCOTP_SRK6_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK6_OFFSET)         /* Shadow Register for OTP Bank3 Word6 (SRK Hash) */
#define IMXRT_OCOTP_SRK7_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK7_OFFSET)         /* Shadow Register for OTP Bank3 Word7 (SRK Hash) */
#define IMXRT_OCOTP_SJC_RESP0_INDEX           IMXRT_OCOTP_O2I(IMXRT_OCOTP_SJC_RESP0_OFFSET)    /* Value of OTP Bank4 Word0 (Secure JTAG Response Field) */
#define IMXRT_OCOTP_SJC_RESP1_INDEX           IMXRT_OCOTP_O2I(IMXRT_OCOTP_SJC_RESP1_OFFSET)    /* Value of OTP Bank4 Word1 (Secure JTAG Response Field) */
#define IMXRT_OCOTP_MAC0_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_MAC0_OFFSET)         /* Value of OTP Bank4 Word2 (MAC Address) */
#define IMXRT_OCOTP_MAC1_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_MAC1_OFFSET)         /* Value of OTP Bank4 Word3 (MAC Address) */
#define IMXRT_OCOTP_MAC2_INDEX                IMXRT_OCOTP_O2I(IMXRT_OCOTP_MAC2_OFFSET)         /* Value of OTP Bank4 Word4 (MAC Address) */
#define IMXRT_OCOTP_OTPMK_CRC32_INDEX         IMXRT_OCOTP_O2I(IMXRT_OCOTP_OTPMK_CRC32_OFFSET)  /* Value of OTP Bank4 Word5 (CRC Key) */
#define IMXRT_OCOTP_SW_GP1_INDEX              IMXRT_OCOTP_O2I(IMXRT_OCOTP_SW_GP1_OFFSET)       /* Value of OTP Bank5 Word0 (SW GP1) */
#define IMXRT_OCOTP_SW_GP20_INDEX             IMXRT_OCOTP_O2I(IMXRT_OCOTP_SW_GP20_OFFSET)      /* Value of OTP Bank5 Word1 (SW GP2) */
#define IMXRT_OCOTP_SW_GP21_INDEX             IMXRT_OCOTP_O2I(IMXRT_OCOTP_SW_GP21_OFFSET)      /* Value of OTP Bank5 Word2 (SW GP2) */
#define IMXRT_OCOTP_SW_GP22_INDEX             IMXRT_OCOTP_O2I(IMXRT_OCOTP_SW_GP22_OFFSET)      /* Value of OTP Bank5 Word3 (SW GP2) */
#define IMXRT_OCOTP_SW_GP23_INDEX             IMXRT_OCOTP_O2I(IMXRT_OCOTP_SW_GP23_OFFSET)      /* Value of OTP Bank5 Word4 (SW GP2) */
#define IMXRT_OCOTP_MISC_CONF0_INDEX          IMXRT_OCOTP_O2I(IMXRT_OCOTP_MISC_CONF0_OFFSET)   /* Value of OTP Bank5 Word5 (Misc Conf) */
#define IMXRT_OCOTP_MISC_CONF1_INDEX          IMXRT_OCOTP_O2I(IMXRT_OCOTP_MISC_CONF1_OFFSET)   /* Value of OTP Bank5 Word6 (Misc Conf) */
#define IMXRT_OCOTP_SRK_REVOKE_INDEX          IMXRT_OCOTP_O2I(IMXRT_OCOTP_SRK_REVOKE_OFFSET)   /* Value of OTP Bank5 Word7 (SRK Revoke) */

#define IMXRT_OCOTP_O2IP(offset)              (((offset) - (IMXRT_OCOTP_LOCK_OFFSET + 0x100)) >> 4)

#define IMXRT_OCOTP_ROM_PATCH0_INDEX          IMXRT_OCOTP_O2IP(IMXRT_OCOTP_ROM_PATCH0_OFFSET)   /* Value of OTP Bank6 Word0 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH1_INDEX          IMXRT_OCOTP_O2IP(IMXRT_OCOTP_ROM_PATCH1_OFFSET)   /* Value of OTP Bank6 Word1 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH2_INDEX          IMXRT_OCOTP_O2IP(IMXRT_OCOTP_ROM_PATCH2_OFFSET)   /* Value of OTP Bank6 Word2 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH3_INDEX          IMXRT_OCOTP_O2IP(IMXRT_OCOTP_ROM_PATCH3_OFFSET)   /* Value of OTP Bank6 Word3 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH4_INDEX          IMXRT_OCOTP_O2IP(IMXRT_OCOTP_ROM_PATCH4_OFFSET)   /* Value of OTP Bank6 Word4 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH5_INDEX          IMXRT_OCOTP_O2IP(IMXRT_OCOTP_ROM_PATCH5_OFFSET)   /* Value of OTP Bank6 Word5 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH6_INDEX          IMXRT_OCOTP_O2IP(IMXRT_OCOTP_ROM_PATCH6_OFFSET)   /* Value of OTP Bank6 Word6 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH7_INDEX          IMXRT_OCOTP_O2IP(IMXRT_OCOTP_ROM_PATCH7_OFFSET)   /* Value of OTP Bank6 Word7 (ROM Patch) */
#define IMXRT_OCOTP_GP30_INDEX                IMXRT_OCOTP_O2IP(IMXRT_OCOTP_GP30_OFFSET)         /* Value of OTP Bank7 Word0 (GP3) */
#define IMXRT_OCOTP_GP31_INDEX                IMXRT_OCOTP_O2IP(IMXRT_OCOTP_GP31_OFFSET)         /* Value of OTP Bank7 Word1 (GP3) */
#define IMXRT_OCOTP_GP32_INDEX                IMXRT_OCOTP_O2IP(IMXRT_OCOTP_GP32_OFFSET)         /* Value of OTP Bank7 Word2 (GP3) */
#define IMXRT_OCOTP_GP33_INDEX                IMXRT_OCOTP_O2IP(IMXRT_OCOTP_GP33_OFFSET)         /* Value of OTP Bank7 Word3 (GP3) */
#define IMXRT_OCOTP_GP40_INDEX                IMXRT_OCOTP_O2IP(IMXRT_OCOTP_GP40_OFFSET)         /* Value of OTP Bank7 Word4 (GP4) */
#define IMXRT_OCOTP_GP41_INDEX                IMXRT_OCOTP_O2IP(IMXRT_OCOTP_GP41_OFFSET)         /* Value of OTP Bank7 Word5 (GP4) */
#define IMXRT_OCOTP_GP42_INDEX                IMXRT_OCOTP_O2IP(IMXRT_OCOTP_GP42_OFFSET)         /* Value of OTP Bank7 Word6 (GP4) */
#define IMXRT_OCOTP_GP43_INDEX                IMXRT_OCOTP_O2IP(IMXRT_OCOTP_GP43_OFFSET)         /* Value of OTP Bank7 Word7 (GP4) */

