apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_ocotp.h
/* Register addresses *******************************************************/

#define IMXRT_OCOTP_CTRL                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CTRL_OFFSET)            /* OTP Controller Control Register */
#define IMXRT_OCOTP_CTRL_SET                  (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CTRL_SET_OFFSET)        /* OTP Controller Control Register */
#define IMXRT_OCOTP_CTRL_CLR                  (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CTRL_CLR_OFFSET)        /* OTP Controller Control Register */
#define IMXRT_OCOTP_CTRL_TOG                  (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CTRL_TOG_OFFSET)        /* OTP Controller Control Register */
#define IMXRT_OCOTP_TIMING                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_TIMING_OFFSET)          /* OTP Controller Timing Register */
#define IMXRT_OCOTP_DATA                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_DATA_OFFSET)            /* OTP Controller Write Data Register */
#define IMXRT_OCOTP_READ_CTRL                 (IMXRT_OCOTP_BASE + IMXRT_OCOTP_READ_CTRL_OFFSET)       /* OTP Controller Write Data Register */
#define IMXRT_OCOTP_READ_FUSE_DATA            (IMXRT_OCOTP_BASE + IMXRT_OCOTP_READ_FUSE_DATA_OFFSET)  /* OTP Controller Read Data Register */
#define IMXRT_OCOTP_SW_STICKY                 (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SW_STICKY_OFFSET)       /* Sticky bit Register */
#define IMXRT_OCOTP_SCS                       (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SCS_OFFSET)             /* Software Controllable Signals Register */
#define IMXRT_OCOTP_SCS_SET                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SCS_SET_OFFSET)         /* Software Controllable Signals Register */
#define IMXRT_OCOTP_SCS_CLR                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SCS_CLR_OFFSET)         /* Software Controllable Signals Register */
#define IMXRT_OCOTP_SCS_TOG                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SCS_TOG_OFFSET)         /* Software Controllable Signals Register */
#define IMXRT_OCOTP_CRC_ADDR                  (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CRC_ADDR_OFFSET)        /* OTP Controller CRC test address */
#define IMXRT_OCOTP_CRC_VALUE                 (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CRC_VALUE_OFFSET)       /* OTP Controller CRC Value Register */
#define IMXRT_OCOTP_VERSION                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_VERSION_OFFSET)         /* OTP Controller Version Register */
#define IMXRT_OCOTP_TIMING2                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_TIMING2_OFFSET)         /* OTP Controller Timing Register */
#define IMXRT_OCOTP_LOCK                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_LOCK_OFFSET)            /* Value of OTP Bank0 Word0 (Lock controls) */
#define IMXRT_OCOTP_CFG0                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CFG0_OFFSET)            /* Value of OTP Bank0 Word1 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG1                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CFG1_OFFSET)            /* Value of OTP Bank0 Word2 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG2                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CFG2_OFFSET)            /* Value of OTP Bank0 Word3 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG3                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CFG3_OFFSET)            /* Value of OTP Bank0 Word4 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG4                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CFG4_OFFSET)            /* Value of OTP Bank0 Word5 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG5                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CFG5_OFFSET)            /* Value of OTP Bank0 Word6 (Configuration and Manufacturing */
#define IMXRT_OCOTP_CFG6                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_CFG6_OFFSET)            /* Value of OTP Bank0 Word7 (Configuration and Manufacturing */
#define IMXRT_OCOTP_MEM0                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MEM0_OFFSET)            /* Value of OTP Bank1 Word0 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM1                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MEM1_OFFSET)            /* Value of OTP Bank1 Word1 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM2                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MEM2_OFFSET)            /* Value of OTP Bank1 Word2 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM3                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MEM3_OFFSET)            /* Value of OTP Bank1 Word3 (Memory Related Info.) */
#define IMXRT_OCOTP_MEM4                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MEM4_OFFSET)            /* Value of OTP Bank1 Word4 (Memory Related Info.) */
#define IMXRT_OCOTP_ANA0                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ANA0_OFFSET)            /* Value of OTP Bank1 Word5 (Analog Info.) */
#define IMXRT_OCOTP_ANA1                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ANA1_OFFSET)            /* Value of OTP Bank1 Word6 (Analog Info.) */
#define IMXRT_OCOTP_ANA2                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ANA2_OFFSET)            /* Value of OTP Bank1 Word7 (Analog Info.) */
#define IMXRT_OCOTP_OTPMK0                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK0_OFFSET)          /* Value of OTP Bank2 Word0 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK1                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK1_OFFSET)          /* Value of OTP Bank2 Word1 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK2                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK2_OFFSET)          /* Value of OTP Bank2 Word2 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK3                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK3_OFFSET)          /* Value of OTP Bank2 Word3 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK4                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK4_OFFSET)          /* Value of OTP Bank2 Word4 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK5                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK5_OFFSET)          /* Value of OTP Bank2 Word5 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK6                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK6_OFFSET)          /* Value of OTP Bank2 Word6 (OTPMK Key) */
#define IMXRT_OCOTP_OTPMK7                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK7_OFFSET)          /* Value of OTP Bank2 Word7 (OTPMK Key) */
#define IMXRT_OCOTP_SRK0                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK0_OFFSET)            /* Shadow Register for OTP Bank3 Word0 (SRK Hash) */
#define IMXRT_OCOTP_SRK1                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK1_OFFSET)            /* Shadow Register for OTP Bank3 Word1 (SRK Hash) */
#define IMXRT_OCOTP_SRK2                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK2_OFFSET)            /* Shadow Register for OTP Bank3 Word2 (SRK Hash) */
#define IMXRT_OCOTP_SRK3                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK3_OFFSET)            /* Shadow Register for OTP Bank3 Word3 (SRK Hash) */
#define IMXRT_OCOTP_SRK4                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK4_OFFSET)            /* Shadow Register for OTP Bank3 Word4 (SRK Hash) */
#define IMXRT_OCOTP_SRK5                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK5_OFFSET)            /* Shadow Register for OTP Bank3 Word5 (SRK Hash) */
#define IMXRT_OCOTP_SRK6                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK6_OFFSET)            /* Shadow Register for OTP Bank3 Word6 (SRK Hash) */
#define IMXRT_OCOTP_SRK7                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK7_OFFSET)            /* Shadow Register for OTP Bank3 Word7 (SRK Hash) */
#define IMXRT_OCOTP_SJC_RESP0                 (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SJC_RESP0_OFFSET)       /* Value of OTP Bank4 Word0 (Secure JTAG Response Field) */
#define IMXRT_OCOTP_SJC_RESP1                 (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SJC_RESP1_OFFSET)       /* Value of OTP Bank4 Word1 (Secure JTAG Response Field) */
#define IMXRT_OCOTP_MAC0                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MAC0_OFFSET)            /* Value of OTP Bank4 Word2 (MAC Address) */
#define IMXRT_OCOTP_MAC1                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MAC1_OFFSET)            /* Value of OTP Bank4 Word3 (MAC Address) */
#define IMXRT_OCOTP_MAC2                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MAC2_OFFSET)            /* Value of OTP Bank4 Word4 (MAC Address) */
#define IMXRT_OCOTP_OTPMK_CRC32               (IMXRT_OCOTP_BASE + IMXRT_OCOTP_OTPMK_CRC32_OFFSET)     /* Value of OTP Bank4 Word5 (CRC Key) */
#define IMXRT_OCOTP_SW_GP1                    (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SW_GP1_OFFSET)          /* Value of OTP Bank5 Word0 (SW GP1) */
#define IMXRT_OCOTP_SW_GP20                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SW_GP20_OFFSET)         /* Value of OTP Bank5 Word1 (SW GP2) */
#define IMXRT_OCOTP_SW_GP21                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SW_GP21_OFFSET)         /* Value of OTP Bank5 Word2 (SW GP2) */
#define IMXRT_OCOTP_SW_GP22                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SW_GP22_OFFSET)         /* Value of OTP Bank5 Word3 (SW GP2) */
#define IMXRT_OCOTP_SW_GP23                   (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SW_GP23_OFFSET)         /* Value of OTP Bank5 Word4 (SW GP2) */
#define IMXRT_OCOTP_MISC_CONF0                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MISC_CONF0_OFFSET)      /* Value of OTP Bank5 Word5 (Misc Conf) */
#define IMXRT_OCOTP_MISC_CONF1                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_MISC_CONF1_OFFSET)      /* Value of OTP Bank5 Word6 (Misc Conf) */
#define IMXRT_OCOTP_SRK_REVOKE                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_SRK_REVOKE_OFFSET)      /* Value of OTP Bank5 Word7 (SRK Revoke) */
#define IMXRT_OCOTP_ROM_PATCH0                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ROM_PATCH0_OFFSET)      /* Value of OTP Bank6 Word0 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH1                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ROM_PATCH1_OFFSET)      /* Value of OTP Bank6 Word1 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH2                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ROM_PATCH2_OFFSET)      /* Value of OTP Bank6 Word2 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH3                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ROM_PATCH3_OFFSET)      /* Value of OTP Bank6 Word3 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH4                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ROM_PATCH4_OFFSET)      /* Value of OTP Bank6 Word4 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH5                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ROM_PATCH5_OFFSET)      /* Value of OTP Bank6 Word5 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH6                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ROM_PATCH6_OFFSET)      /* Value of OTP Bank6 Word6 (ROM Patch) */
#define IMXRT_OCOTP_ROM_PATCH7                (IMXRT_OCOTP_BASE + IMXRT_OCOTP_ROM_PATCH7_OFFSET)      /* Value of OTP Bank6 Word7 (ROM Patch) */
#define IMXRT_OCOTP_GP30                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_GP30_OFFSET)            /* Value of OTP Bank7 Word0 (GP3) */
#define IMXRT_OCOTP_GP31                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_GP31_OFFSET)            /* Value of OTP Bank7 Word1 (GP3) */
#define IMXRT_OCOTP_GP32                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_GP32_OFFSET)            /* Value of OTP Bank7 Word2 (GP3) */
#define IMXRT_OCOTP_GP33                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_GP33_OFFSET)            /* Value of OTP Bank7 Word3 (GP3) */
#define IMXRT_OCOTP_GP40                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_GP40_OFFSET)            /* Value of OTP Bank7 Word4 (GP4) */
#define IMXRT_OCOTP_GP41                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_GP41_OFFSET)            /* Value of OTP Bank7 Word5 (GP4) */
#define IMXRT_OCOTP_GP42                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_GP42_OFFSET)            /* Value of OTP Bank7 Word6 (GP4) */
#define IMXRT_OCOTP_GP43                      (IMXRT_OCOTP_BASE + IMXRT_OCOTP_GP43_OFFSET)            /* Value of OTP Bank7 Word7 (GP4) */

/* 64 Bit unique id consisting of:
 * LOT_NO_ENC[42:0] 42 bits LOT ID
 *     IMXRT_OCOTP_UNIQUE_ID_MSB[31:0] IMXRT_OCOTP_UNIQUE_ID_LSB[10:0]
 * WAFER_NO[4:0] 5 bits The wafer number of the wafer on which the device
 * was fabricated IMXRT_OCOTP_UNIQUE_ID_LSB[15:11]
 * DIE-YCORDINATE[7:0] 8 bits The Y-coordinate of the die location
 * on the wafer IMXRT_OCOTP_UNIQUE_ID_LSB[23:16]
 * DIE-XCORDINATE[7:0] 8 bits The X-coordinate of the die location
 * on the wafer IMXRT_OCOTP_UNIQUE_ID_LSB[31:24]
 */
#define IMXRT_OCOTP_UNIQUE_ID_MSB             (IMXRT_OCOTP_CFG0) /* Most Significant Bytes of 64 bit UUID */
#define IMXRT_OCOTP_UNIQUE_ID_LSB             (IMXRT_OCOTP_CFG1) /* Least Significant Bytes of 64 bit UUID */

/* Register Bit Definitions *************************************************/

