apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_ocotp.h
/* OTP Controller Control Register */

#define OCOTP_CTRL_ADDR_SHIFT                 (0)        /* Bits: 0-5  ADDR */
#define OCOTP_CTRL_ADDR_MASK                  (0x3f << OCOTP_CTRL_ADDR_SHIFT)
#  define OCOTP_CTRL_ADDR(n)                  ((uint32_t)(n) << OCOTP_CTRL_ADDR_SHIFT)
                                                         /* Bits: 6-7  Reserved */
#define OCOTP_CTRL_BUSY                       (1 << 8)   /* Bit: 8  BUSY */
#define OCOTP_CTRL_ERROR                      (1 << 9)   /* Bit: 9  ERROR */
#define OCOTP_CTRL_RELOAD_SHADOWS             (1 << 10)  /* Bit: 10 OWS */
#define OCOTP_CTRL_CRC_TEST                   (1 << 11)  /* Bit: 11 CRC_TEST */
#define OCOTP_CTRL_CRC_FAIL                   (1 << 12)  /* Bit: 12 CRC_FAIL */
                                                         /* Bits: 13-15 Reserved */
#define OCOTP_CTRL_WR_UNLOCK_SHIFT            (16)       /* Bits: 16-31  WR_UNLOCK */
#define OCOTP_CTRL_WR_UNLOCK_MASK             (0xffff << OCOTP_CTRL_WR_UNLOCK_SHIFT)
#  define OCOTP_CTRL_WR_UNLOCK                (0x3e77 << OCOTP_CTRL_WR_UNLOCK_SHIFT)

/* OTP Controller Timing Register */

#define OCOTP_TIMING_STROBE_PROG_SHIFT        (0)        /* Bits: 0-11  Specifies the strobe period in one time write OTP */
#define OCOTP_TIMING_STROBE_PROG_MASK         (0xfff << OCOTP_TIMING_STROBE_PROG_SHIFT)
#  define OCOTP_TIMING_STROBE_PROG(n)         ((uint32_t)(n) << OCOTP_TIMING_STROBE_PROG_SHIFT)
#define OCOTP_TIMING_RELAX_SHIFT              (12)       /* Bits: 12-15  Specifies the time to add to all default timing parameters other than the Tpgm and Trd. */
#define OCOTP_TIMING_RELAX_MASK               (15 << OCOTP_TIMING_RELAX_SHIFT)
#  define OCOTP_TIMING_RELAX(n)               ((uint32_t)(n) << OCOTP_TIMING_RELAX_SHIFT)
#define OCOTP_TIMING_STROBE_READ_SHIFT        (16)       /* Bits: 16-21  Specifies the strobe period in one time read OTP. */
#define OCOTP_TIMING_STROBE_READ_MASK         (0x3f << OCOTP_TIMING_STROBE_READ_SHIFT)
#  define OCOTP_TIMING_STROBE_READ(n)         ((uint32_t)(n) << OCOTP_TIMING_STROBE_READ_SHIFT)
#define OCOTP_TIMING_WAIT_SHIFT               (22)       /* Bits: 22-27  Specifies time interval between auto read and write access in one time program */
#define OCOTP_TIMING_WAIT_MASK                (0x3f << OCOTP_TIMING_WAIT_SHIFT)
#  define OCOTP_TIMING_WAIT(n)                ((uint32_t)(n) << OCOTP_TIMING_WAIT_SHIFT)
                                                         /* Bits: 28-31  Reserved */

/* OTP Controller Write Data Register */

#define OCOTP_READ_CTRL_READ_FUSE             (1 << 0)   /* Bit: 0 Used to initiate a read to OTP */
                                                         /* Bits: 1-31 Reserved */

/* Sticky bit Register */

#define OCOTP_SW_STICKY_BLOCK_DTCP_KEY        (1 << 0)   /* Bit: 0  Shadow register read and OTP read lock for DTCP_KEY region. */
#define OCOTP_SW_STICKY_SRK_REVOKE_LOCK       (1 << 1)   /* Bit: 1  Shadow register write and OTP write lock for SRK_REVOKE region. */
#define OCOTP_SW_STICKY_FIELD_RETURN_LOCK     (1 << 2)   /* Bit: 2  Shadow register write and OTP write lock for FIELD_RETURN region. */
#define OCOTP_SW_STICKY_BLOCK_ROM_PART        (1 << 3)   /* Bit: 3  Set by ARM during Boot after DTCP is initialized and before test mode entry, if ROM_PART_LOCK=1.*/
#define OCOTP_SW_STICKY_JTAG_BLOCK_RELEASE    (1 << 4)   /* Bit: 4  Set by ARM during Boot after DTCP is initialized and before test mode entry. */
                                                         /* Bits: 5-31  Reserved */

/* Software Controllable Signals Register */

#define OCOTP_SCS_HAB_JDE                     (1 << 0)   /* Bit: 0  HAB JTAG Debug Enable. */
#define OCOTP_SCS_SPARE_SHIFT                 (1)        /* Bits: 1-30  Unallocated read/write bits for implementation specific software use. */
#define OCOTP_SCS_SPARE_MASK                  (0x3fffffff << OCOTP_SCS_SPARE_SHIFT)
#  define OCOTP_SCS_SPARE(n)                  ((uint32_t)(n) << OCOTP_SCS_SPARE_SHIFT)
#define OCOTP_SCS_LOCK                        (1 << 31)  /* Bit: 31 LOCK */

/* OTP Controller CRC test address */

#define OCOTP_CRC_ADDR_DATA_START_ADDR_SHIFT  (0)        /* Bits: 0-7  Start address of fuse location for CRC calculation */
#define OCOTP_CRC_ADDR_DATA_START_ADDR_MASK   (0xff << OCOTP_CRC_ADDR_DATA_START_ADDR_SHIFT)
#  define OCOTP_CRC_ADDR_DATA_START_ADDR(n)   ((uint32_t)(n) << OCOTP_CRC_ADDR_DATA_START_ADDR_SHIFT)
#define OCOTP_CRC_ADDR_DATA_END_ADDR_SHIFT    (8)        /* Bits: 8-15  End address of fuse location for CRC calculation */
#define OCOTP_CRC_ADDR_DATA_END_ADDR_MASK     (0xff << OCOTP_CRC_ADDR_DATA_END_ADDR_SHIFT)
#  define OCOTP_CRC_ADDR_DATA_END_ADDR(n)     ((uint32_t)(n) << OCOTP_CRC_ADDR_DATA_END_ADDR_SHIFT)
#define OCOTP_CRC_ADDR_CRC_ADDR_SHIFT         (16)       /* Bits: 16-23  Address of 32-bit CRC result for comparing */
#define OCOTP_CRC_ADDR_CRC_ADDR_MASK          (0xff << OCOTP_CRC_ADDR_CRC_ADDR_SHIFT)
#  define OCOTP_CRC_ADDR_CRC_ADDR(n)          ((uint32_t)(n) << OCOTP_CRC_ADDR_CRC_ADDR_SHIFT)
#define OCOTP_CRC_ADDR_OTPMK_CRC              (1 << 24)  /* Bit: 24 Enable bit for OCOTP CRC32 calculation address. */
                                                         /* Bits: 25-31  Reserved */

/* OTP Controller Version Register */

#define OCOTP_VERSION_STEP_SHIFT              (0)        /* Bits: 0-15  STEP field of the RTL version.*/
#define OCOTP_VERSION_STEP_MASK               (0xffff << OCOTP_VERSION_STEP_SHIFT)
#  define OCOTP_VERSION_STEP(n)               ((uint32_t)(n) << OCOTP_VERSION_STEP_SHIFT)
#define OCOTP_VERSION_MINOR_SHIFT             (16)       /* Bits: 16-23  MINOR field of the RTL version. */
#define OCOTP_VERSION_MINOR_MASK              (0xff << OCOTP_VERSION_MINOR_SHIFT)
#  define OCOTP_VERSION_MINOR(n)              ((uint32_t)(n) << OCOTP_VERSION_MINOR_SHIFT)
#define OCOTP_VERSION_MAJOR_SHIFT             (24)       /* Bits: 24-31  MAJOR field of the RTL version. */
#define OCOTP_VERSION_MAJOR_MASK              (0xff << OCOTP_VERSION_MAJOR_SHIFT)
#  define OCOTP_VERSION_MAJOR(n)              ((uint32_t)(n) << OCOTP_VERSION_MAJOR_SHIFT)

/* OTP Controller Timing Register */

