apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_ocotp.h
#define OCOTP_TIMING2_RELAX_PROG_SHIFT        (0)        /* Bits: 0-11  Specifies the strobe period in one time write OTP. */
#define OCOTP_TIMING2_RELAX_PROG_MASK         (0xfff << OCOTP_TIMING2_RELAX_PROG_SHIFT)
#  define OCOTP_TIMING2_RELAX_PROG(n)         ((uint32_t)(n) << OCOTP_TIMING2_RELAX_PROG_SHIFT)
                                                         /* Bits: 12-15  Reserved. These bits always read back zero. */
#define OCOTP_TIMING2_RELAX_READ_SHIFT        (16)       /* Bits: 16-21  Specifies the strobe period in one time read OTP. */
#define OCOTP_TIMING2_RELAX_READ_MASK         (0x3f << OCOTP_TIMING2_RELAX_READ_SHIFT)
#  define OCOTP_TIMING2_RELAX_READ(n)         ((uint32_t)(n) << OCOTP_TIMING2_RELAX_READ_SHIFT)
                                                         /* Bits: 22-31  Reserved. These bits always read back zero. */

/* Value of OTP Bank0 Word0 (Lock controls) */

#define OCOTP_LOCK_TESTER_SHIFT               (0)        /* Bits: 0-1  Chapter 22 On-Chip OTP Controller (OCOTP_CTRL) */
#define OCOTP_LOCK_TESTER_MASK                (3 << OCOTP_LOCK_TESTER_SHIFT)
#  define OCOTP_LOCK_TESTER(n)                ((uint32_t)(n) << OCOTP_LOCK_TESTER_SHIFT)
#define OCOTP_LOCK_BOOT_CFG_SHIFT             (2)        /* Bits: 2-3  Status of shadow register and OTP write lock for boot_cfg region. */
#define OCOTP_LOCK_BOOT_CFG_MASK              (3 << OCOTP_LOCK_BOOT_CFG_SHIFT)
#  define OCOTP_LOCK_BOOT_CFG(n)              ((uint32_t)(n) << OCOTP_LOCK_BOOT_CFG_SHIFT)
#define OCOTP_LOCK_MEM_TRIM_SHIFT             (4)        /* Bits: 4-5  Status of shadow register and OTP write lock for mem_trim region.  */
#define OCOTP_LOCK_MEM_TRIM_MASK              (3 << OCOTP_LOCK_MEM_TRIM_SHIFT)
#  define OCOTP_LOCK_MEM_TRIM(n)              ((uint32_t)(n) << OCOTP_LOCK_MEM_TRIM_SHIFT)
#define OCOTP_LOCK_SJC_RESP                   (1 << 6)   /* Bit: 6  Status of shadow register read and write, OTP read and write lock for sjc_resp region. */
#define OCOTP_LOCK_GP4_RLOCK                  (1 << 7)   /* Bit: 7  Status of shadow register and OTP read lock for gp4 region. */
#define OCOTP_LOCK_MAC_ADDR_SHIFT             (8)        /* Bits: 8-9  Status of shadow register and OTP write lock for mac_addr region.  */
#define OCOTP_LOCK_MAC_ADDR_MASK              (3 << OCOTP_LOCK_MAC_ADDR_SHIFT)
#  define OCOTP_LOCK_MAC_ADDR(n)              ((uint32_t)(n) << OCOTP_LOCK_MAC_ADDR_SHIFT)
#define OCOTP_LOCK_GP1_SHIFT                  (10)       /* Bits: 10-11  Status of shadow register and OTP write lock for gp2 region. */
#define OCOTP_LOCK_GP1_MASK                   (3 << OCOTP_LOCK_GP1_SHIFT)
#  define OCOTP_LOCK_GP1(n)                   ((uint32_t)(n) << OCOTP_LOCK_GP1_SHIFT)
#define OCOTP_LOCK_GP2_SHIFT                  (12)       /* Bits: 12-13  Status of shadow register and OTP write lock for gp2 region.*/
#define OCOTP_LOCK_GP2_MASK                   (3 << OCOTP_LOCK_GP2_SHIFT)
#  define OCOTP_LOCK_GP2(n)                   ((uint32_t)(n) << OCOTP_LOCK_GP2_SHIFT)
#define OCOTP_LOCK_SRK                        (1 << 14)  /* Bit: 14 Status of shadow register and OTP write lock for srk region.  */
#define OCOTP_LOCK_ROM_PATCH                  (1 << 15)  /* Bit: 15 Status of shadow register and OTP write lock for rom_patch region.  */
#define OCOTP_LOCK_SW_GP1                     (1 << 16)  /* Bit: 16 Status of shadow register and OTP write lock for sw_gp1 region.*/
#define OCOTP_LOCK_OTPMK                      (1 << 17)  /* Bit: 17 Status of shadow register and OTP write lock for OTPMK region.  */
#define OCOTP_LOCK_ANALOG_SHIFT               (18)       /* Bits: 18-19  Status of shadow register and OTP write lock for analog region. */
#define OCOTP_LOCK_ANALOG_MASK                (3 << OCOTP_LOCK_ANALOG_SHIFT)
#define OCOTP_LOCK_SW_GP2_LOCK                (1 << 21)  /* Bit: 21 Status of shadow register and OTP write lock for sw_gp2 region.*/
#define OCOTP_LOCK_MISC_CONF                  (1 << 22)  /* Bit: 22 Status of shadow register and OTP write lock for misc_conf region.*/
#define OCOTP_LOCK_SW_GP2_RLOCK               (1 << 23)  /* Bit: 23 Status of shadow register and OTP read lock for sw_gp2 region. */
#define OCOTP_LOCK_GP4_SHIFT                  (24)       /* Bits: 24-25  Status of shadow register and OTP write lock for GP4 region. */
#define OCOTP_LOCK_GP4_MASK                   (3 << OCOTP_LOCK_GP4_SHIFT)
#  define OCOTP_LOCK_GP4(n)                   ((uint32_t)(n) << OCOTP_LOCK_GP4_SHIFT)
#define OCOTP_LOCK_GP3_SHIFT                  (26)       /* Bits: 26-27  Status of shadow register and OTP write lock for GP3 region. */
#define OCOTP_LOCK_GP3_MASK                   (3 << OCOTP_LOCK_GP3_SHIFT)
#  define OCOTP_LOCK_GP3(n)                   ((uint32_t)(n) << OCOTP_LOCK_GP3_SHIFT)
#define OCOTP_LOCK_FIELD_RETURN_SHIFT         (28)       /* Bits: 28-31  When write field_return shadow register(only highest 4bits valid), the bits[27:0] must be kept as 0. */
#define OCOTP_LOCK_FIELD_RETURN_MASK          (15 << OCOTP_LOCK_FIELD_RETURN_SHIFT)
#  define OCOTP_LOCK_FIELD_RETURN(n)          ((uint32_t)(n) << OCOTP_LOCK_FIELD_RETURN_SHIFT)

#endif /* CONFIG_ARCH_FAMILY_IMXRT117x / CONFIG_ARCH_FAMILY_IMXRT118x */

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_OCOTP_H */
